CSI API ETABS v1
cFile.NewSteelDeck Method
 Creates a new steel deck model from template.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int NewSteelDeck(
	int NumberStorys,
	double TypicalStoryHeight,
	double BottomStoryHeight,
	int NumberLinesX,
	int NumberLinesY,
	double SpacingX,
	double SpacingY
)
Function NewSteelDeck (
	NumberStorys As Integer,
	TypicalStoryHeight As Double,
	BottomStoryHeight As Double,
	NumberLinesX As Integer,
	NumberLinesY As Integer,
	SpacingX As Double,
	SpacingY As Double
) As Integer
Dim instance As cFile
Dim NumberStorys As Integer
Dim TypicalStoryHeight As Double
Dim BottomStoryHeight As Double
Dim NumberLinesX As Integer
Dim NumberLinesY As Integer
Dim SpacingX As Double
Dim SpacingY As Double
Dim returnValue As Integer
returnValue = instance.NewSteelDeck(NumberStorys,
	TypicalStoryHeight, BottomStoryHeight,
	NumberLinesX, NumberLinesY, SpacingX,
	SpacingY)
int NewSteelDeck(
	int NumberStorys,
	double TypicalStoryHeight,
	double BottomStoryHeight,
	int NumberLinesX,
	int NumberLinesY,
	double SpacingX,
	double SpacingY
)
abstract NewSteelDeck :
        NumberStorys : int *
        TypicalStoryHeight : float *
        BottomStoryHeight : float *
        NumberLinesX : int *
        NumberLinesY : int *
        SpacingX : float *
        SpacingY : float -> int
Parameters
NumberStorys
Type: System.Int32
The number of stories in the model
TypicalStoryHeight
Type: System.Double
The story height that will be used for all stories in the model, except the bottom story. [L]
BottomStoryHeight
Type: System.Double
The story height that will be used for the bottom story. [L]
NumberLinesX
Type: System.Int32
The number of grid lines in the X direction.
NumberLinesY
Type: System.Int32
The number of grid lines in the Y direction.
SpacingX
Type: System.Double
The uniform spacing for grid lines in the X direction. [L]
SpacingY
Type: System.Double
The uniform spacing for grid lines in the Y direction. [L]
Return Value
Type: Int32
Returns zero if the new steel deck model is successfully created; otherwise it returns a nonzero value.
Remarks
Do not use this function to add to an existing model. This function should be used only for creating a new model and typically would be preceded by a call to InitializeNewModel(eUnits).
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cFile Interface
ETABSv1 Namespace